<template>
<div>
  3. Предыстория. Истоки истории вашего персонажа могут описывать, почему он выбрал дорогу приключений, и как он стал тем, кем является.

  сделать, как передача по id, то есть отображаться будет 1 предыстория, допилить фотки

  Значение выбрано на основании выбранного ранее класса:

  Солдат [Soldier] Воин
  Сколько вы помните, в вашей жизни всегда была война. С молодости вы проходили тренировки, учились использовать оружие и доспехи, изучали технику выживания, включая то, как оставаться живым на поле боя. Вы могли быть частью армии страны или отряда наёмников, а может, были местным ополченцем во время войны.

  Мудрец [Sage] Маг
  Вы провели много лет, постигая тайны мультивселенной. Вы читали рукописи, изучали свитки, и общались с величайшими экспертами в интересующих вас темах. Всё это сделало вас знатоком в своей области.

  Беспризорник [Urchin] Плут
  Вы выросли на улице в бедности и одиночестве, лишённые родителей. Никто не присматривал и не заботился о вас, и вам пришлось научиться делать это самому. Вам приходилось постоянно бороться за еду и следить за другими неприкаянными душами, способными обокрасть вас. Вы спали на чердаках и в переулках, мокли под дождём и боролись с болезнями, не получая медицинской помощи или приюта. Вы выжили, невзирая на все трудности, и сделали это благодаря своей сноровке, силе или скорости.

  Артист [Entertainer] Бард
  Вам нравится выступать на публике. Вы знаете, как их развлечь, очаровать и даже воодушевить. Ваша поэзия может трогать сердца слушателей, пробуждать в них горе или радость, смех или гнев. Ваша музыка ободряет их или заставляет скорбеть. Ваши танцы захватывают, а шутки всегда смешны. Чем бы вы ни занимались, ваша жизнь тесно связана с искусство.

  Народный герой (Folk hero) Паладин
  У вас было низкое социальное положение, но судьбой было уготовано большее. Жители вашей родной деревни уже считают вас своим героем, но вам предначертано сражаться с тиранами и чудовищами, угрожающими другим.

  Отшельник [Hermit] Друид
  Вы значительную часть своей жизни прожили в уединении — либо в закрытой общине, такой как монастырь, либо вообще в одиночестве. Вдали от шумного общества вы нашли тишину, спокойствие, а возможно, и ответы на важные вопросы.

  4. Оружие (нет в форме)

  это перенести в класс:

  Воин (Полуорк / Человек / Дварф)
  Длинный меч (ближний бой)
  атака: модификатор силы + бонус мастерства
  урон: 1к8 рубящий урон + модификатор силы

  Маг (Человек / Эльф)
  Боевой посох
  атака: модификатор Силы
  урон: 1к6 дробящий урон + модификатор Силы

  Плут (Халфлинг / Эльф)
  Арбалет, лёгкий
  атака: модификатор Ловкости + бонус мастерства
  урон: 1к8 колющий урон + модификатор Ловкости

  Бард (Человек / Эльф)
  Рапира
  атака: модификатор Ловкости + бонус мастерства
  урон: 1к8 колющий урон + модификатор Ловкости

  Паладин (Полуорк / Человек / Дварф)
  Двуручный меч
  атака: модификатор Силы + бонус мастерства
  урон: 2к6 рубящий урон + модификатор Силы

  Друид (Человек / Эльф)
  Боевой посох
  атака: модификатор Силы
  урон: 1к6 дробящий урон + модификатор Силы

  5. Мировоззрение, это то какие моральные принципы определяют поведение персонажа и чем он будет руководствоваться при выборе стратегии.

  Законопослушный (добрый) – любишь порядок и традиции
  Хаотично-добрый - свободный дух, но хочешь помогать
  Истинно-нейтральное - не заботишься о морали
  Хаотично-злое - любишь разрушение и хаос

  6. Характеристики

  Выберите и распределите следующие значения в зависимости от потребностей вашего персонажа:

  Для человека сделать все характеристики +1 (модификаторы обновляются отдельно)!!!!!!
  15 (модификатор +2), если 16 будет +3
  14 (модификатор +2), если 15 будет +2
  13 (модификатор +1), если 14 будет +2
  12 (модификатор +1), если 13 будет +1
  10 (модификатор 0), если 11 будет 0
  8 (модификатор -1), если 9 юудет -1

  бонус мастерства +2 (для первого уровня)

  Спасброски:
  Оставляем как и модификаторы (но добавляется бонус мастерства +2 в зависимости от класса):
  Воин: Сила, Телосложение
  Маг: Интеллект, Мудрость
  Плут: Ловкость, Интеллект
  Бард: Ловкость, Харизма
  Паладин: Мудрость, Харизма
  Друид: Интеллект, Мудрость

  Навыки:
  добавляем +2 бонуса мастерства по классу:
  Воин: Выживание, Восприятие или Внимательность (муд)
  Маг: Проницательность, Медицина
  Плут: Акробатика, Обман
  Бард: Убеждение, Обман
  Паладин: Запугивание, Атлетика
  Друид: Восприятие, Природа

  добавляем +2 бонуса мастерства по предыстории:
  Воин - Солдат: Атлетика, Запугивание
  Маг - Мудрец: История, Магия
  Плут - Беспризорник: Ловкость рук, Скрытность
  Бард - Артист: Акробатика, Выступление
  Паладин - Народный герой: Выживание, Уход за животными
  Друид - Отшельник: Медицина, Религия

  Расчет класса доспеха (КД):
  Воин: тяжелый доспех (кольчуга) 16 (сила не меньше 13)
  Маг: без доспеха 10 + ловкость
  Плут: легкий доспех (кожаный) 11 + ловкость
  Бард: легкий доспех (кожаный) 11 + ловкость
  Паладин: тяжелый доспех (кольчуга) 16 (сила не меньше 13) +2 за щит
  Друид: легкий доспех (кожаный) 11 + ловкость

  Скорость: 30 футов для всех

  Максимум хитов (хп, здоровье):
  кость хитов из класса (на первом уровне максимально возможный) + модификатор телослосложения
  Воин: 10 + модификатор телослосложения
  Маг: 6 + модификатор телослосложения
  Плут: 8 + модификатор телослосложения
  Бард: 8 + модификатор телослосложения
  Паладин: 10 + модификатор телослосложения
  Друид: 8 + модификатор телослосложения

  Инициатива:
  Записывается модификатор ловкости

  Сила (физическая мощь)
  Ловкость (проворство)
  Телосложение (выносливость)
  Интеллект (рассудительность и память, книжные знания)
  Мудрость (внимательность и проницательность, житейские знания)
  Харизма (возможность обмануть или очаровать собеседника)

  С более подробной информацией можно ознакомиться по ссылке: https://dnd.su/

</div>

</template>

<script setup lang="ts">

</script>

<style scoped>

</style>